---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.Dispose
source: html/805f028f-5843-2c22-d3c7-5d091c2a0a0e.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.Dispose Method

Releases all resources used by the PipePlumbingFixtureFlowData

## Syntax (C#)
```csharp
public void Dispose()
```